{
  "用生體": {
    "overall": "這是一個大吉的卦象，代表外在環境或貴人對您主動付出，使您無須費力就能心想事成。用卦生助體卦，萬事順利。",
    "love": {
      "本卦": "關係發展順利，對方對您主動付出。",
      "互卦": "過程中會有貴人或外在助力，使感情進展迅速。",
      "變卦": "最終能完全滿足您的願望，關係美滿。大吉。"
    },
    "career": {
      "本卦": "事業有貴人相助，機會從天而降。",
      "互卦": "工作過程中有許多意想不到的助力，事半功倍。",
      "變卦": "最終能得到豐厚回報，事業大成。大吉。"
    },
    "wealth": {
      "本卦": "財運極佳，有意外之財或被動收入。",
      "互卦": "投資或求財過程中，有貴人指點或機會主動出現。",
      "變卦": "最終能財源廣進，財富累積。大吉。"
    },
    "health": {
      "本卦": "外在環境或貴人對您的健康有益，例如遇到良醫、找到適合的療法。",
      "互卦": "治療過程順利，身體能快速吸收藥物或營養。",
      "變卦": "最終能完全康復，身體得到滋養。大吉。"
    },
    "relationship": {
      "本卦": "人際關係和諧，能從他人身上獲得支持與幫助。",
      "互卦": "在與人互動的過程中，能輕鬆解決問題，廣結善緣。",
      "變卦": "最終能建立穩固且有益的人脈網。大吉。"
    },
    "life": {
      "本卦": "生活順心如意，有貴人相助，事事順利。",
      "互卦": "過程中常有驚喜，能輕鬆解決困難。",
      "變卦": "最終能心想事成，生活安泰。大吉。"
    },
    "guidance": {
      "本卦": "您的問題將從外在尋求解決，並能得到有力支援。",
      "互卦": "指引的過程充滿順利，您能輕鬆找到答案。",
      "變卦": "最終能找到明確的方向，心無旁騖。大吉。"
    },
    "建議": {
      "general": "您的運勢極佳，事情將會順利發展。請善用外在的助力，抓住機會，無須過度勞心。"
    }
  },
  "體生用": {
    "overall": "這是一個中吉的卦象，代表您需要付出努力或主動去爭取，才能有所回報。體卦生助用卦，先付出後收穫。",
    "love": {
      "本卦": "感情需要您主動付出或經營，關係才能穩定。",
      "互卦": "過程中可能會有考驗或阻礙，但只要努力就能克服。",
      "變卦": "最終能達成所願，但需要經歷一番努力。中吉。"
    },
    "career": {
      "本卦": "事業需要您親力親為，展現才能，才能得到認可。",
      "互卦": "過程中可能需要額外努力或加班，但這些付出都是值得的。",
      "變卦": "最終能成功實現目標，得到應有的回報。中吉。"
    },
    "wealth": {
      "本卦": "財運需要您主動開拓，例如積極投資或努力工作。",
      "互卦": "求財過程中會有波折，但只要堅持就能見到成果。",
      "變卦": "最終能累積財富，但屬於勞力所得。中吉。"
    },
    "health": {
      "本卦": "健康需要您主動保養，例如規律運動、調整作息。",
      "互卦": "康復過程可能需要較長的時間，但只要堅持就能好轉。",
      "變卦": "最終能恢復健康，但需持續努力。中吉。"
    },
    "relationship": {
      "本卦": "人際關係需要您主動維護和付出，才能獲得他人的信任和支持。",
      "互卦": "過程中可能會有誤會或摩擦，但只要溝通就能化解。",
      "變卦": "最終能建立良好的人脈，但需要用心經營。中吉。"
    },
    "life": {
      "本卦": "生活需要您主動創造，才能實現理想。",
      "互卦": "過程中可能會有挑戰，但這些都是成長的機會。",
      "變卦": "最終能心想事成，但需要辛勤耕耘。中吉。"
    },
    "guidance": {
      "本卦": "您的問題需要您主動去尋找解決方案，不要被動等待。",
      "互卦": "尋求指引的過程會有些曲折，但答案就在您努力的路上。",
      "變卦": "最終能找到方向，但必須付出努力。中吉。"
    },
    "建議": {
      "general": "此卦代表事情需要您付出努力和心血。只要您積極主動，不怕辛勞，最終必能達成目標。"
    }
  },
  "用剋體": {
    "overall": "這是一個大凶的卦象，代表外在環境或人事物對您不利，充滿阻礙和壓力。用卦剋制體卦，諸事不順。",
    "love": {
      "本卦": "感情關係充滿挑戰，可能面臨外部壓力或第三者問題。",
      "互卦": "過程中會有許多爭執和不愉快，難以溝通。",
      "變卦": "最終結果不理想，可能導致關係破裂。大凶。"
    },
    "career": {
      "本卦": "事業面臨巨大阻力，可能遇到小人或來自競爭者的壓力。",
      "互卦": "工作進展困難重重，事倍功半，難以突破。",
      "變卦": "最終可能失敗，或無法達成預期目標。大凶。"
    },
    "wealth": {
      "本卦": "財運極差，可能面臨破財或投資失利。",
      "互卦": "求財過程中會有意外支出或詐騙風險。",
      "變卦": "最終導致財物損失，甚至背負債務。大凶。"
    },
    "health": {
      "本卦": "健康狀況不佳，可能受到外界病毒或環境的影響而生病。",
      "互卦": "治療過程不順利，病情可能加重或難以根治。",
      "變卦": "最終可能導致健康惡化，難以恢復。大凶。"
    },
    "relationship": {
      "本卦": "人際關係緊張，可能與他人發生衝突，受到排擠或攻擊。",
      "互卦": "在與人互動的過程中，常有誤解和矛盾。",
      "變卦": "最終可能導致關係斷裂，孤立無援。大凶。"
    },
    "life": {
      "本卦": "生活充滿阻礙，事事不順，常常感到壓力重重。",
      "互卦": "過程中會遇到許多突發狀況，難以應對。",
      "變卦": "最終結果不如人意，生活充滿困境。大凶。"
    },
    "guidance": {
      "本卦": "您的問題無法從外界得到解決，反而會受到阻礙。",
      "互卦": "尋求指引的過程充滿陷阱和錯誤資訊。",
      "變卦": "最終將走向錯誤的方向，情況更糟。大凶。"
    },
    "建議": {
      "general": "此卦運勢極差，不宜輕舉妄動。應靜觀其變，避免正面衝突，保守為上策，等待時機。切忌冒險。"
    }
  },
  "體剋用": {
    "overall": "這是一個中凶的卦象，代表您雖然有能力或企圖心去改變現狀，但過程艱辛，成功機率較低。體卦剋制用卦，以小博大，難度高。",
    "love": {
      "本卦": "您對這段感情的付出得不到對方同等的回應，關係進展緩慢。",
      "互卦": "您需要不斷地努力去維持關係，但成效不彰。",
      "變卦": "最終可能徒勞無功，關係難以穩定。中凶。"
    },
    "career": {
      "本卦": "您有改變現狀的企圖心，但外部環境或競爭者難以撼動。",
      "互卦": "工作中的努力難以得到應有回報，可能感到挫敗。",
      "變卦": "最終可能難以達成目標，或結果不盡理想。中凶。"
    },
    "wealth": {
      "本卦": "您有強烈的求財慾望，但財路受阻，難以突破。",
      "互卦": "投資或求財的過程充滿變數，難以控制。",
      "變卦": "最終可能損失部分財物，或無法獲得預期收益。中凶。"
    },
    "health": {
      "本卦": "您積極尋求治療，但病情頑固，難以根治。",
      "互卦": "治療過程漫長且辛苦，可能感到身心俱疲。",
      "變卦": "最終可能難以完全康復，仍需長期與疾病抗爭。中凶。"
    },
    "relationship": {
      "本卦": "您努力維繫人際關係，但難以得到他人的認可或重視。",
      "互卦": "您在與人溝通時感到力不從心，難以說服他人。",
      "變卦": "最終可能仍無法建立有效的人脈網。中凶。"
    },
    "life": {
      "本卦": "您積極面對生活中的挑戰，但困難重重，難以突破。",
      "互卦": "過程充滿阻礙，常常感到力不從心。",
      "變卦": "最終可能無法改變現狀，需調整心態。中凶。"
    },
    "guidance": {
      "本卦": "您試圖主導解決問題，但方向不對，難以找到正確的指引。",
      "互卦": "尋找答案的過程充滿挫折，每一步都走得艱難。",
      "變卦": "最終可能走向死胡同，無法解決問題。中凶。"
    },
    "建議": {
      "general": "此卦運勢不佳，您需要付出極大的努力，但成功機率低。建議重新評估目標，或暫時擱置，等待更好的時機。切忌硬碰硬。"
    }
  },
  "體用比和": {
    "overall": "這是一個平順的卦象，代表外在環境與您的目標相輔相成，運勢穩定。體卦與用卦五行相同，諸事順利，無須過度擔憂。",
    "love": {
      "本卦": "感情穩定，雙方關係融洽。",
      "互卦": "過程中沒有太多波折，順其自然。",
      "變卦": "最終能維持穩定的關係，平順發展。平順。"
    },
    "career": {
      "本卦": "事業穩定，工作環境和諧。",
      "互卦": "工作進展順利，沒有太多阻礙。",
      "變卦": "最終能維持穩定的職位，發展平順。平順。"
    },
    "wealth": {
      "本卦": "財運穩定，沒有大起大落。",
      "互卦": "求財過程平順，沒有意外損失。",
      "變卦": "最終能維持穩定的收入，收支平衡。平順。"
    },
    "health": {
      "本卦": "健康狀況良好，身體穩定。",
      "互卦": "身體沒有太大問題，保持現狀。",
      "變卦": "最終能維持良好的健康狀態。平順。"
    },
    "relationship": {
      "本卦": "人際關係穩定，與朋友相處愉快。",
      "互卦": "與人互動順利，沒有太多矛盾。",
      "變卦": "最終能維持良好的人脈，關係穩固。平順。"
    },
    "life": {
      "本卦": "生活平靜順遂，沒有太多煩惱。",
      "互卦": "過程沒有太多變數，一切按計畫進行。",
      "變卦": "最終能維持平穩的生活，心境安寧。平順。"
    },
    "guidance": {
      "本卦": "您的問題將會順利解決，無需過度焦慮。",
      "互卦": "尋求指引的過程平穩，答案會自然浮現。",
      "變卦": "最終能找到明確的方向，心無旁騖。平順。"
    },
    "建議": {
      "general": "此卦運勢平穩，適合按部就班，穩紮穩打。無須冒進，保持現狀即可。若有目標，持續努力即可達成。"
    }
  }
}
