{
  "用生體": {
    "overall": "這是一個大吉的卦象，代表外在環境或貴人對您主動付出，使您無須費力就能心想事成。",
    "details": {
      "乾卦生體": {
        "title": "乾金生體卦",
        "description": "主有官方、公職、長輩或尊貴人士相助。事情能得到官方認可，或因名聲、地位而獲利。有意外之財，或長輩饋贈。",
        "love": "感情上得到長輩支持，或對方地位顯赫，能為您帶來幫助。",
        "career": "事業上得貴人提拔，或有升職加薪、名聲遠播的機會。",
        "wealth": "財運來自長輩、官方或高層人士，或有投資黃金、珠寶獲利之喜。",
        "guidance": "請多向長輩或有經驗的人請教，他們將是您的貴人。"
      },
      "坤卦生體": {
        "title": "坤土生體卦",
        "description": "主有田地、房產之利，或得女性、大眾、基層人士的幫助。事情踏實穩定，能循序漸進地取得成果。",
        "love": "感情基礎穩固，能得到女性長輩或親友的支持。關係踏實，能給您安全感。",
        "career": "事業上能獲得基層或大眾的支持，適合從事房地產、農業或與大眾服務相關的行業。",
        "wealth": "財運來自不動產、土地或穩定的被動收入。適合穩健投資，財富能逐步累積。",
        "guidance": "腳踏實地，穩紮穩打，不要急於求成。與人為善，能得眾人之助。"
      },
      "震卦生體": {
        "title": "震木生體卦",
        "description": "主有突發之喜，或來自東方的財利。事情進展快速，能因變動而獲益。",
        "love": "感情進展迅速，可能有閃電式戀愛或意外的驚喜。對方充滿活力，能帶給您新鮮感。",
        "career": "事業有新的機會出現，適合開拓新市場或展開新專案。變動能帶來升職機會。",
        "wealth": "有意外之財或動態收入，適合投資新興產業或快速流通的商品。",
        "guidance": "抓住機會，果斷行動。主動出擊，能事半功倍。"
      },
      "巽卦生體": {
        "title": "巽木生體卦",
        "description": "主有山林之利，或來自東南方、經商而得財。事情能順利進行，適合交易買賣。",
        "love": "感情關係順利，能因共同興趣或旅行而增進感情。適合與對方一起探索新事物。",
        "career": "事業進展順利，適合從事銷售、貿易或與流通相關的行業。能從溝通協調中獲益。",
        "wealth": "財運來自交易、商業買賣，適合經商或投資流動性強的商品。",
        "guidance": "保持彈性與開放的心態，順應趨勢而為。多與人交流，能獲得商機。"
      },
      "坎卦生體": {
        "title": "坎水生體卦",
        "description": "主有來自北方或與水、酒相關的財利。事情能因溝通、文書而順利，或有酒食宴會之喜。",
        "love": "感情能從深入溝通中獲得滋養，適合敞開心扉，坦誠相待。",
        "career": "事業上適合從事寫作、出版、法律或與溝通相關的行業。能從合約或文書中獲得好處。",
        "wealth": "財運來自北方、與水相關的行業（如漁業、航運）或文書合約。有因應酬而得財的機會。",
        "guidance": "多與人溝通，解決問題的關鍵在於信息的交流。保持冷靜與耐心，不要被表象迷惑。"
      },
      "離卦生體": {
        "title": "離火生體卦",
        "description": "主有南方之財，或文書、名譽之喜。事情能得到認可，或因名氣而獲利。",
        "love": "感情關係充滿熱情，能得到公開認可。雙方樂於展現自我，關係高調而熱烈。",
        "career": "事業上能因名氣、創意或曝光而成功。適合從事演藝、媒體、設計或任何需要展現自我的行業。",
        "wealth": "財運來自南方、與火相關的行業（如能源、餐飲）或智慧財產。適合投資具有高知名度的品牌。",
        "guidance": "展現您的才華與熱情，能吸引好運。保持正面形象，名聲將為您帶來財富。"
      },
      "艮卦生體": {
        "title": "艮土生體卦",
        "description": "主有來自東北方或山林、田地之財。事情能穩健進展，最終能達到目標。",
        "love": "感情關係穩定，能因共同的興趣或穩定的生活而增進感情。適合建立長期的承諾。",
        "career": "事業發展穩健，適合從事房地產、建築或需要耐心的長期專案。",
        "wealth": "財運來自不動產或與土地相關的投資，適合長期持有，能穩步增值。",
        "guidance": "保持耐心與毅力，所有努力最終都會有收穫。不要急於改變，堅守目標是成功的關鍵。"
      },
      "兌卦生體": {
        "title": "兌金生體卦",
        "description": "主有喜悅事，或因口舌、飲食而得利。能因人際關係和諧而獲益。",
        "love": "感情關係和諧愉快，能因良好的溝通和歡樂的氛圍而增進感情。適合享受生活中的小確幸。",
        "career": "事業上能因口才、人脈或社交而成功。適合從事銷售、公關或與娛樂相關的行業。",
        "wealth": "財運來自口才、人脈或餐飲娛樂業。有因喜事宴會而得財的機會。",
        "guidance": "多與人交流，保持樂觀的心態，能吸引更多好運。享受當下，是最好的回報。"
      }
    }
  },
  "體生用": {
    "overall": "這是一個凶險的卦象，代表您付出多但收穫少，容易勞而無功。在行動前務必三思。",
    "details": {
      "乾卦生用": {
        "title": "體卦乾金生用",
        "description": "主為公事、名譽而勞心，或因追求名聲、地位而損財。付出極大，但回報不彰。",
        "love": "感情中您付出較多，但可能得不到同等的回報，或因面子、金錢問題而耗損心力。",
        "career": "為工作付出大量心血，但成果與付出不成正比，甚至可能名聲受損。",
        "wealth": "財運不佳，投資或花費過多，入不敷出。或為維護形象而大筆開銷。",
        "guidance": "重新評估目標，學會放手。不要為虛名而勞心勞力。"
      },
      "坤卦生用": {
        "title": "體卦坤土生用",
        "description": "主為人際關係或家庭事務勞碌，付出辛勤勞動，但收穫甚微。易為他人作嫁衣。",
        "love": "您在感情中過於包容或付出，但對方可能視為理所當然，容易感到疲憊。",
        "career": "工作上為他人善後或做基層的辛苦活，但功勞可能被他人奪走。",
        "wealth": "財運不佳，容易為了家人或人際關係而花費過多，導致財務緊張。",
        "guidance": "照顧好自己，不要過度為他人付出。學會拒絕與適度放手。"
      },
      "震卦生用": {
        "title": "體卦震木生用",
        "description": "主因行動、衝動或變動而耗損精力。做事常虎頭蛇尾，付出後卻沒有顯著成果。",
        "love": "感情中您過於主動或衝動，但可能沒有考慮對方的感受，導致關係沒有實質進展。",
        "career": "事業上頻繁變動或轉換跑道，但沒有累積，導致勞而無功。",
        "wealth": "財運不佳，因衝動消費或不切實際的投資而破財。",
        "guidance": "三思而後行，避免衝動。將精力集中在一件事上，才能看到成果。"
      },
      "巽卦生用": {
        "title": "體卦巽木生用",
        "description": "主因過度謙讓或優柔寡斷而耗損。付出多但效率低，容易陷入無謂的消耗。",
        "love": "感情中您過於被動或無法明確表達，導致關係停滯不前，錯失良機。",
        "career": "工作上猶豫不決，或因過度考慮他人感受而無法推進專案。",
        "wealth": "財運不佳，因過度謹慎或錯失良機而無法獲利。",
        "guidance": "果斷決策，避免拖延。堅定自己的立場，才能減少不必要的消耗。"
      },
      "坎卦生用": {
        "title": "體卦坎水生用",
        "description": "主為人際關係、酒色或危險之事而耗損。付出多，但可能被他人欺騙或利用。",
        "love": "感情中您過度付出，但可能被對方利用或欺騙，需謹慎。",
        "career": "工作上可能為他人背黑鍋或陷入複雜的辦公室政治中，難以自拔。",
        "wealth": "財運不佳，容易因投資失誤、借貸或被騙而損失錢財。",
        "guidance": "保持警惕，不要輕易相信他人。遠離是非，保護好自己的利益。"
      },
      "離卦生用": {
        "title": "體卦離火生用",
        "description": "主因情緒、脾氣或虛名而耗損。付出多但成果浮華，容易有口舌是非。",
        "love": "感情中您過於情緒化或急躁，導致關係緊張。過度的熱情可能嚇到對方。",
        "career": "工作上常因情緒用事或過度張揚而影響人際關係，導致無法順利推展。",
        "wealth": "財運不佳，容易因炫耀、虛榮心或一時衝動而花錢如流水。",
        "guidance": "保持冷靜，管理好情緒。凡事低調，才能減少是非與消耗。"
      },
      "艮卦生用": {
        "title": "體卦艮土生用",
        "description": "主為不動產、家庭或人際關係付出，但進展緩慢或停滯不前。感到心有餘而力不足。",
        "love": "感情中您付出很多耐心與時間，但對方可能沒有積極回應，關係停滯。",
        "career": "工作進展緩慢，遇到瓶頸或阻礙，需要長時間的努力才能有微小進展。",
        "wealth": "財運不佳，投資不動產或長期項目可能被套牢，難以變現。",
        "guidance": "學會變通，不要固執己見。有時放手，才能找到新的出路。"
      },
      "兌卦生用": {
        "title": "體卦兌金生用",
        "description": "主因言語、口舌或享樂而耗損精力與財富。容易因一時的歡樂而付出代價。",
        "love": "感情中您可能過度遷就或言不由衷，導致關係不平衡，感到心累。",
        "career": "工作上可能因閒言閒語或不當言論而惹上麻煩，影響工作進展。",
        "wealth": "財運不佳，容易因應酬、娛樂或享樂而花費過多，導致財務空虛。",
        "guidance": "謹言慎行，避免無謂的口舌。量入為出，才能避免財務危機。"
      }
    }
  },
  "用剋體": {
    "overall": "這是一個大凶的卦象，代表外在環境充滿威脅，您將處於被動挨打的局面。務必謹慎行事，以柔克剛。",
    "details": {
      "乾卦剋體": {
        "title": "用卦乾金克體",
        "description": "主有官方、公職或長輩所帶來的麻煩。或因金錢、名譽而受損。應謹防來自權威的壓力。",
        "love": "感情中對方過於強勢，可能對您造成傷害，或因長輩反對而受阻。",
        "career": "事業上遇到上司刁難、官司訴訟或被權貴壓制，難以施展抱負。",
        "wealth": "有破財之憂，尤其與金融、黃金或公務相關的損失。應避免投資高風險項目。",
        "guidance": "切勿硬碰硬，保持低調，尋求其他管道解決問題。遠離權勢鬥爭。"
      },
      "坤卦剋體": {
        "title": "用卦坤土克體",
        "description": "主有田土、房產之擾，或得女性、小人之害。應謹防來自基層或身邊人的暗算。",
        "love": "感情中可能因家庭事務或女性長輩的反對而受阻，或對方與您關係不平等。",
        "career": "事業上可能因同事、基層人員的排擠或打小報告而受損。避免與人有土地或房產上的糾紛。",
        "wealth": "有因不動產、土地或女性而破財的風險。應謹慎處理任何與此相關的交易。",
        "guidance": "保持謙遜，遠離是非。謹慎處理與女性、家庭相關的事務。"
      },
      "震卦剋體": {
        "title": "用卦震木克體",
        "description": "主有虛驚、恐懼之事，或因外來變動而受驚。應謹防突發事件或外來的衝擊。",
        "love": "感情中可能發生突發性的爭執或變故，讓您措手不及。",
        "career": "事業上可能因突發狀況、人事變動或意外而受阻。注意與東方人的合作。",
        "wealth": "有意外之財的損失，或因突發事件而需要大筆開銷。應避免衝動性投資。",
        "guidance": "保持冷靜，隨時做好應變準備。不要輕易被外在的變化所影響。"
      },
      "巽卦剋體": {
        "title": "用卦巽木克體",
        "description": "主有東南方之人相害，或因優柔寡斷而受困。應謹防小人算計或被他人左右。",
        "love": "感情中可能因第三者介入或對方猶豫不決而受傷。要注意來自東南方的人。",
        "career": "事業上可能因小人背後說閒話或被不誠實的合作夥伴拖累。",
        "wealth": "有被欺騙或因優柔寡斷而錯失良機，導致財務受損。",
        "guidance": "果斷決策，不要輕易受他人影響。謹慎選擇合作夥伴。"
      },
      "坎卦剋體": {
        "title": "用卦坎水克體",
        "description": "主有險陷之事，或因水、酒、色而生災。應謹防被他人設下陷阱或欺騙。",
        "love": "感情中可能遇到不誠實或有不良意圖的人，甚至被欺騙感情。",
        "career": "事業上可能因契約、文書或法律問題而陷入困境，甚至有官司之憂。",
        "wealth": "財運極差，有破財、被騙或借貸糾紛的風險。應避免所有與賭博相關的行為。",
        "guidance": "保持警惕，不要輕易相信承諾。凡事三思而後行，遠離誘惑。"
      },
      "離卦克體": {
        "title": "用卦離火克體",
        "description": "主有文書之擾或失火之驚。應謹防口舌是非、名譽受損或意外事件。",
        "love": "感情中可能因誤會、口舌是非或衝動而產生激烈爭吵，導致關係破裂。",
        "career": "事業上可能因文書錯誤、合約問題或名譽受損而陷入困境。要特別注意用火安全。",
        "wealth": "有因衝動消費、投資失利或意外火災而破財的風險。",
        "guidance": "謹言慎行，避免捲入口舌是非。在簽署任何文件前務必仔細閱讀。"
      },
      "艮卦剋體": {
        "title": "用卦艮土克體",
        "description": "主諸事多連，百謀中阻。應謹防來自東北方、山林或田地的禍害，或因固執而受困。",
        "love": "感情中可能因雙方固執己見而陷入僵局，難以溝通。",
        "career": "事業上遇到難以突破的瓶頸或阻力，無論怎麼努力都難以進展。",
        "wealth": "有因不動產或與土地相關的投資而被套牢的風險，或因固執而錯失賣出的時機。",
        "guidance": "學會變通，不要固執己見。有時退一步海闊天空，放手可能是更好的選擇。"
      },
      "兌卦剋體": {
        "title": "用卦兌金克體",
        "description": "主口舌紛爭，或因飲食而生憂愁。應謹防來自西方的禍害，或因人際關係而受損。",
        "love": "感情中充滿口舌是非或爭吵，雙方難以溝通。",
        "career": "事業上可能因同事之間的閒言閒語或不當言論而影響工作。",
        "wealth": "有因應酬、飲食或享樂而造成財務損失的風險。",
        "guidance": "謹言慎行，避免捲入是非。遠離愛嚼舌根的人，保護好自己的名譽。"
      }
    }
  },
  "體剋用": {
    "overall": "這是一個吉利的卦象，代表您對所問之事有主導權或控制力，事情多能順利達成。只要保持謹慎與積極的態度，成功可期。",
    "details": {
      "乾卦剋體": {
        "title": "體卦乾金克用",
        "description": "主能掌控公務、名譽或權威相關之事，事情順利推進，可因積極行動而得利。來自官方或長輩的阻力能被您克服。",
        "love": "感情中您占主導地位，能引導關係發展。對方可能較被動，需注意溝通以免顯得過於強勢。",
        "career": "事業上您能掌控局面，適合領導項目或與公職、權威人士合作。可因主動爭取而獲得升職或認可。",
        "wealth": "財運順遂，特別在金融、黃金或公務相關領域有獲利機會。適合積極投資，但需注意風險管理。",
        "guidance": "把握主導權，積極行動。但需保持謙遜，避免過於強勢而引起反彈。"
      },
      "坤卦剋體": {
        "title": "體卦坤土克用",
        "description": "主能掌控不動產、家庭或基層事務，事情穩健推進，可因耐心與努力而得利。來自女性或大眾的阻力能被您化解。",
        "love": "感情中您能穩定局面，關係踏實發展。對方可能依賴您，需注意給予對方適當空間。",
        "career": "事業上您能穩步推進，適合從事房地產、農業或大眾服務相關行業。可因穩健經營而獲得成功。",
        "wealth": "財運來自不動產或穩健投資，利於長期持有。需注意避免過於保守而錯失機會。",
        "guidance": "保持耐心與穩健，穩紮穩打。與人為善，能獲得更多支持。"
      },
      "震卦剋體": {
        "title": "體卦震木克用",
        "description": "主能掌控變動或突發之事，事情進展迅速，可因果斷行動而得利。來自東方或快速變化的阻力能被您克服。",
        "love": "感情中您主動積極，能帶動關係快速進展。需注意避免過於急進，給對方適當的適應時間。",
        "career": "事業上您能抓住機會，適合開拓新市場或展開新項目。可因快速決策而獲得成功。",
        "wealth": "財運來自新興產業或快速流通的商品，利於短期投資。需注意評估風險，避免衝動。",
        "guidance": "果斷行動，把握時機。但需謹慎評估，避免因過急而失誤。"
      },
      "巽卦剋體": {
        "title": "體卦巽木克用",
        "description": "主能掌控交易、溝通或東南方之事，事情順利推進，可因靈活應對而得利。來自小人或流言的阻力能被您化解。",
        "love": "感情中您能主導關係發展，通過良好溝通增進感情。需注意避免過於操控，保持真誠。",
        "career": "事業上您能靈活應對，適合從事銷售、貿易或溝通相關行業。可因人脈而獲得成功。",
        "wealth": "財運來自商業交易或流動性強的投資，利於靈活操作。需注意謹慎選擇合作對象。",
        "guidance": "保持靈活與開放的心態，多與人交流。但需謹慎，避免被小人利用。"
      },
      "坎卦剋體": {
        "title": "體卦坎水克用",
        "description": "主能掌控與水、溝通或北方相關之事，事情順利推進，可因智慧與耐心而得利。來自陷阱或欺騙的阻力能被您化解。",
        "love": "感情中您能通過深入溝通主導關係，增進彼此了解。需注意坦誠，避免誤會。",
        "career": "事業上您能掌控局面，適合從事寫作、法律或溝通相關行業。可因智慧而獲得成功。",
        "wealth": "財運來自與水相關的行業或文書合約，利於穩健操作。需注意審慎簽署文件。",
        "guidance": "以智慧與耐心應對，注重溝通。保持警惕，避免落入他人圈套。"
      },
      "離卦剋體": {
        "title": "體卦離火克用",
        "description": "主能掌控名譽、文書或南方之事，事情順利推進，可因創意與熱情而得利。來自口舌或爭議的阻力能被您化解。",
        "love": "感情中您能以熱情主導關係，增進彼此親密度。需注意控制情緒，避免爭執。",
        "career": "事業上您能展現才華，適合從事演藝、媒體或創意相關行業。可因名氣而獲得成功。",
        "wealth": "財運來自與火相關的行業或智慧財產，利於高知名度投資。需注意避免衝動消費。",
        "guidance": "展現才華與熱情，但需保持冷靜。謹言慎行，避免口舌是非。"
      },
      "艮卦克體": {
        "title": "體卦艮土克用",
        "description": "主能掌控不動產或東北方之事，事情穩健推進，可因耐心與毅力而得利。來自阻礙或固執的阻力能被您化解。",
        "love": "感情中您能穩定關係，通過耐心建立長期承諾。需注意避免過於固執，保持溝通。",
        "career": "事業上您能穩步推進，適合從事房地產或長期項目。可因耐心而獲得成功。",
        "wealth": "財運來自不動產或長期投資，利於穩健操作。需注意靈活應對市場變化。",
        "guidance": "保持耐心與毅力，但需適時變通。穩健經營能帶來長期回報。"
      },
      "兌卦剋體": {
        "title": "體卦兌金克用",
        "description": "主能掌控人際關係或飲食相關之事，事情順利推進，可因口才與人脈而得利。來自口舌或爭議的阻力能被您化解。",
        "love": "感情中您能通過良好溝通主導關係，增進和諧氛圍。需注意避免過於遷就，保持平衡。",
        "career": "事業上您能憑藉人脈與口才成功，適合從事銷售或公關相關行業。可因人際關係而獲利。",
        "wealth": "財運來自人脈或與飲食相關的行業，利於靈活操作。需注意控制應酬開支。",
        "guidance": "善用人脈與口才，但需謹言慎行。保持和諧的人際關係是成功的關鍵。"
      }
    }
  },
  "比和": {
    "overall": "這是一個平穩的卦象，代表沒有外在阻力，也沒有額外的助力。凡事需要腳踏實地，按部就班。",
    "details": {
      "乾卦比和": {
        "title": "體用皆乾",
        "description": "主事事順利，能因權威、長輩或公務而成功。但需保持謙遜，避免過於強勢。",
        "love": "感情穩定，雙方地位對等，能互相扶持。但可能缺乏浪漫，關係較為嚴肅。",
        "career": "事業發展平順，適合擔任領導職務。工作按部就班，能得到預期成果。",
        "wealth": "財運平穩，收入來源穩定。適合穩健理財，不會有大起大落。",
        "guidance": "維持現狀，保持謙虛。避免過於獨斷專行，多聽取他人意見。"
      },
      "坤卦比和": {
        "title": "體用皆坤",
        "description": "主事事順利，能因大眾、家庭或土地而成功。但需腳踏實地，避免好高騖遠。",
        "love": "感情穩定，雙方能給予彼此安全感。關係踏實，適合長久發展。",
        "career": "事業基礎穩固，適合從事房地產或需要耐心的長期專案。能得到大眾支持。",
        "wealth": "財運平穩，適合投資不動產或農產品。能穩步累積財富。",
        "guidance": "按部就班，穩紮穩打。不要急於求成，一切都會有好的結果。"
      },
      "震卦比和": {
        "title": "體用皆震",
        "description": "主事事順利，能因行動力而成功。但需注意情緒管理，避免過於衝動。",
        "love": "感情進展迅速，雙方充滿活力。但需注意溝通，避免因衝動而爭執。",
        "career": "事業發展順利，適合開拓新市場或展開新專案。能因行動力而獲利。",
        "wealth": "財運平穩，適合投資新興產業。能因快速決策而獲利。",
        "guidance": "抓住機會，果斷行動。但需謹慎，避免因衝動而犯錯。"
      },
      "巽卦比和": {
        "title": "體用皆巽",
        "description": "主事事順利，能因溝通、交易而成功。但需注意人際關係，避免被流言蜚語影響。",
        "love": "感情關係和諧，雙方能順利溝通。但需注意坦誠相待，避免隱藏心事。",
        "career": "事業發展順利，適合從事銷售、貿易或與溝通相關的行業。能因良好的人脈而獲利。",
        "wealth": "財運平穩，適合經商或投資流動性強的商品。能因良好的人脈而獲利。",
        "guidance": "保持開放的心態，多與人交流。但需謹慎，避免被他人利用。"
      },
      "坎卦比和": {
        "title": "體用皆坎",
        "description": "主事事順利，能因智慧、溝通而成功。但需注意情緒管理，避免陷入憂鬱。",
        "love": "感情關係能從深入溝通中獲得滋養。但需注意坦誠相待，避免隱瞞心事。",
        "career": "事業發展順利，適合從事寫作、法律或與溝通相關的行業。能因智慧而獲利。",
        "wealth": "財運平穩，適合投資與水相關的行業。能因智慧而獲利。",
        "guidance": "多與人交流，解決問題的關鍵在於溝通。保持冷靜與耐心，能找到答案。"
      },
      "離卦比和": {
        "title": "體用皆離",
        "description": "主事事順利，能因名氣、創意而成功。但需注意情緒管理，避免因過於衝動而犯錯。",
        "love": "感情關係充滿熱情，雙方樂於展現自我。但需注意坦誠相待，避免過於情緒化。",
        "career": "事業發展順利，適合從事演藝、媒體、設計或任何需要展現自我的行業。能因名氣而獲利。",
        "wealth": "財運平穩，適合投資與火相關的行業。能因名氣而獲利。",
        "guidance": "展現您的才華與熱情，能吸引好運。但需謹慎，避免因衝動而犯錯。"
      },
      "艮卦比和": {
        "title": "體用皆艮",
        "description": "主事事順利，能因穩健、耐心而成功。但需注意變通，避免過於固執己見。",
        "love": "感情關係穩定，雙方能給予彼此安全感。但需注意坦誠相待，避免隱藏心事。",
        "career": "事業發展順利，適合從事房地產、建築或需要耐心的長期專案。能因穩健而獲利。",
        "wealth": "財運平穩，適合投資不動產。能因穩健而獲利。",
        "guidance": "保持耐心與毅力，一切都會有好的結果。但需注意變通，避免過於固執己見。"
      },
      "兌卦比和": {
        "title": "體用皆兌",
        "description": "主事事順利，能因口才、人脈而成功。但需注意口舌是非，避免因不當言論而犯錯。",
        "love": "感情關係和諧，雙方能順利溝通。但需注意坦誠相待，避免口是心非。",
        "career": "事業發展順利，適合從事銷售、公關或與娛樂相關的行業。能因良好的人脈而獲利。",
        "wealth": "財運平穩，適合投資與口才、人脈相關的行業。能因良好的人脈而獲利。",
        "guidance": "多與人交流，保持樂觀的心態。但需謹慎，避免因口舌是非而犯錯。"
      }
    }
  },
  "體用同宮": {
    "overall": "這是一個平順的卦象，代表您與外在環境處於和諧狀態，沒有衝突。只要按部就班，就能順利達成目標。",
    "details": {
      "乾卦同宮": {
        "title": "天風姤、風天小畜",
        "description": "主事事順利，能與他人和諧共處。但需注意謙遜，避免過於獨斷專行。",
        "love": "感情關係和諧，能與對方和諧共處。但需注意坦誠相待，避免隱藏心事。",
        "career": "事業發展順利，能與同事、上司協調合作。但需注意謙遜，避免過於獨斷專行。",
        "wealth": "財運平穩，收入來源穩定。能與他人合作，共同創造財富。",
        "guidance": "保持謙遜與開放的心態，能與他人和諧共處。"
      },
      "坤卦同宮": {
        "title": "地雷復、雷地豫",
        "description": "主事事順利，能與他人和諧共處。但需注意謙遜，避免過於獨斷專行。",
        "love": "感情關係和諧，能與對方和諧共處。但需注意坦誠相待，避免隱藏心事。",
        "career": "事業發展順利，能與同事、上司協調合作。但需注意謙遜，避免過於獨斷專行。",
        "wealth": "財運平穩，收入來源穩定。能與他人合作，共同創造財富。",
        "guidance": "保持謙遜與開放的心態，能與他人和諧共處。"
      },
      "震卦同宮": {
        "title": "雷地豫、地雷復",
        "description": "主事事順利，能與他人和諧共處。但需注意謙遜，避免過於獨斷專行。",
        "love": "感情關係和諧，能與對方和諧共處。但需注意坦誠相待，避免隱藏心事。",
        "career": "事業發展順利，能與同事、上司協調合作。但需注意謙遜，避免過於獨斷專行。",
        "wealth": "財運平穩，收入來源穩定。能與他人合作，共同創造財富。",
        "guidance": "保持謙遜與開放的心態，能與他人和諧共處。"
      },
      "巽卦同宮": {
        "title": "風天小畜、天風姤",
        "description": "主事事順利，能與他人和諧共處。但需注意謙遜，避免過於獨斷專行。",
        "love": "感情關係和諧，能與對方和諧共處。但需注意坦誠相待，避免隱藏心事。",
        "career": "事業發展順利，能與同事、上司協調合作。但需注意謙遜，避免過於獨斷專行。",
        "wealth": "財運平穩，收入來源穩定。能與他人合作，共同創造財富。",
        "guidance": "保持謙遜與開放的心態，能與他人和諧共處。"
      },
      "坎卦同宮": {
        "title": "水火既濟、火水未濟",
        "description": "主事事順利，能與他人和諧共處。但需注意謙遜，避免過於獨斷專行。",
        "love": "感情關係和諧，能與對方和諧共處。但需注意坦誠相待，避免隱藏心事。",
        "career": "事業發展順利，能與同事、上司協調合作。但需注意謙遜，避免過於獨斷專行。",
        "wealth": "財運平穩，收入來源穩定。能與他人合作，共同創造財富。",
        "guidance": "保持謙遜與開放的心態，能與他人和諧共處。"
      },
      "離卦同宮": {
        "title": "火水未濟、水火既濟",
        "description": "主事事順利，能與他人和諧共處。但需注意謙遜，避免過於獨斷專行。",
        "love": "感情關係和諧，能與對方和諧共處。但需注意坦誠相待，避免隱藏心事。",
        "career": "事業發展順利，能與同事、上司協調合作。但需注意謙遜，避免過於獨斷專行。",
        "wealth": "財運平穩，收入來源穩定。能與他人合作，共同創造財富。",
        "guidance": "保持謙遜與開放的心態，能與他人和諧共處。"
      },
      "艮卦同宮": {
        "title": "山風蠱、風山漸",
        "description": "主事事順利，能與他人和諧共處。但需注意謙遜，避免過於獨斷專行。",
        "love": "感情關係和諧，能與對方和諧共處。但需注意坦誠相待，避免隱藏心事。",
        "career": "事業發展順利，能與同事、上司協調合作。但需注意謙遜，避免過於獨斷專行。",
        "wealth": "財運平穩，收入來源穩定。能與他人合作，共同創造財富。",
        "guidance": "保持謙遜與開放的心態，能與他人和諧共處。"
      },
      "兌卦同宮": {
        "title": "澤山咸、山澤損",
        "description": "主事事順利，能與他人和諧共處。但需注意謙遜，避免過於獨斷專行。",
        "love": "感情關係和諧，能與對方和諧共處。但需注意坦誠相待，避免隱藏心事。",
        "career": "事業發展順利，能與同事、上司協調合作。但需注意謙遜，避免過於獨斷專行。",
        "wealth": "財運平穩，收入來源穩定。能與他人合作，共同創造財富。",
        "guidance": "保持謙遜與開放的心態，能與他人和諧共處。"
      }
    }
  }
}
